# PROJECT TITLE

#### PROJECT DESCRIPTION

The following is the relationship entity diagram for the WORLD database which has three tables:

- city

- country

- countrylanguage

- northamerica

![ERD (1).png](<attachment:ERD (1).png>)

In [9]:
import pandas as pd 
import numpy as np 
import mysql.connector
import warnings
warnings.filterwarnings("ignore")

In [10]:
# create a connection 
conn = mysql.connector.connect(host='localhost', port='3306',user='root',password='franco@2022',database='world')

In [11]:
# show all the tables in the database 

pd.read_sql_query('SHOW TABLES', conn)

   Tables_in_world
0             city
1          country
2  countrylanguage
3     northamerica